-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::date; <--
-------------------------------------------------------------------------
SQL State: 22007
ERROR: "1" is invalid for type "DATE", format "TEXT" and datestyle "ISO, YMD"
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::date; <--
-------------------------------------------------------------------------
SQL State: 42846
ERROR: Cannot cast type INTEGER to type DATE
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::int; <--
-------------------------------------------------------------------------
SQL State: 22P02
ERROR: Invalid input syntax for type integer: 'Zero'
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::varchar; <--
-------------------------------------------------------------------------
1
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::bool; <--
-------------------------------------------------------------------------
SQL State: 22P02
ERROR: Invalid input syntax for type boolean: 'Zero' is not a valid boolean value
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::varchar(3); <--
-------------------------------------------------------------------------
123
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::numeric(10,1); <--
-------------------------------------------------------------------------
123456
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::varchar(3); <--
-------------------------------------------------------------------------
1.1
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::numeric(10,2); <--
-------------------------------------------------------------------------
12.12
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::numeric; <--
-------------------------------------------------------------------------
12.123
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::numeric(3); <--
-------------------------------------------------------------------------
123
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::numeric(3); <--
-------------------------------------------------------------------------
123
-------------------------------------------------------------------------
 --> Running query (row limit: 0): select ?::numeric; <--
-------------------------------------------------------------------------
123456
